import json

types = ['Espresso-based', 'Cold Brew', 'Whipped Coffee', 'Filter Coffee', 'Traditional', 'Immersion Brewing']


COFFEE = [
    'Espresso', 'Cappuccino', 'Flat White', 'Cortado', 'Nitro Cold Brew',  # Шоколад
    'Americano', 'Macchiato', 'Irish Coffee', 'Dalgona Coffee', 'Iced Coffee',  # Карамель
    'Latte',  # В целом сладкий
    'Cold Brew',  # Сладкий запах
    'Turkish Coffee',  # Роза
    'Mocha', 'Affogato',  # Ваниль
    'Drip Coffee',  # Пепельный
    'French Press',  # Тёмный шоколад
    'Aeropress',  # Яблоко
    'Pour Over',  # Жасмин
    'Vietnamese Egg Coffee',  # Вишня
]

COFFEE = list(map(str.lower, COFFEE))

leafs = ['Оливковое масло', 'Сырые продукты', 'Незрелый', 'Стручковый горох', 'Тёмная зелень', 'Растительный', 'Сено', 'Пряные травы', 'Бобовый', 'Кислый запах', 'Уксусная кислота', 'Масляная кислота', 'Изовалериановая', 'Лимонная кислота', 'Яблочная кислота', 'Вино', 'Виски', 'Забродивший', 'Перезрелый',
          'Ежевика', 'Малина', 'Черника', 'Клубника', 'Изюм', 'Чернослив', 'Кокос', 'Вишня', 'Гранат', 'Ананас', 'Виноград', 'Яблоко', 'Персик', 'Груша', 'Грейпфрут', 'Апельсин', 'Лимон', 'Лайм',
          'Жасмин', 'Роза', 'Ромашка', 'Чёрный кофе', 'Мёд', 'Карамель', 'Кленовый сироп', 'Меласса', 'Ваниль', 'Ванилин', 'В целом сладкий', 'Сладкий запах', 'Тёмный шоколад','Шоколад', 'Миндаль', 'Фундук', 'Арахис',
          'Гвоздика', 'Корица', 'Мускат', 'Анис', 'Перец', 'Пикантный', 'Солод', 'Зерновой', 'Поджаренный', 'Дымный', 'Пепельный', 'Едкий', 'Табак', 'Табак для трубки',
          'Резина', 'Латекс', 'Нефтяной', 'Медицинский', 'Солёный', 'Горький', 'Фенольный', 'Мясной/Бульонный', 'Животный', 'Затхлый/Земельный', 'Затхлый/Пыльный', 'Затхлый/Сырой', 'Древесный', 'Бумажный', 'Картонный', 'Затхлый']
leafs = list(map(str.lower, leafs))

# матрица смежности {{'name1': 'name', 'name2': "name", "val": 10},...}


if __name__ == '__main__':
    print(COFFEE)


